# IsRelative Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkOptions..::..IsRelative Property
RevitLinkOptions Class See Also
---
The type of path to use when creating the link. If true, Revit will store a relative path for the link. If false, Revit will store an absolute path. If the link is to a Revit Server location, isRelative must be false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsRelative { get; set; }
```

Visual Basic
---
```text
Public Property IsRelative As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsRelative {
	bool get ();
	void set (bool value);
}
```

# See Also
RevitLinkOptions Class
Autodesk.Revit.DB Namespace